<template>
    <div name="schoolBriefIntroduction">

        <div class="container-fluid">

            <img src="../../public/img/title8.jpg" class="img-fluid container-fluid" @click="drawer = true"/>
            <el-collapse accordion >
                <el-collapse-item v-for="(item,i) in context" :key="i">
                    <template slot="title">
                        <i class="header-icon el-icon-s-unfold"></i>
                        {{item.title}}
                        <i class="header-icon el-icon-info"></i>
                    </template>
                    <div class="mm-font2 text-left">
                        {{item.con}}
                    </div>
                </el-collapse-item>
            </el-collapse>
            <hr>
            <img src="../../public/img/school/nw1.jpg" class="img-fluid " @click="drawer = true"/>
            <img src="../../public/img/school/nw2.jpg" class="img-fluid " @click="drawer = true"/>
            <hr>


            <el-drawer
                    title="致您们的一封信"
                    :visible.sync="drawer"
                    :with-header="false"
                    direction="btt"

                    >

                <el-tabs type="border-card">
                    <el-tab-pane label="致家长们、朋友们">
                       <b>
                           尊敬的各位家长、各位朋友：
                       </b>
                        您坦然放心地把您们的子女交给我们，我们铿锵有力地回答您: 我们会给您一个满意的软件人才!
                        只要学员能够提供足够的兴趣、足够的时间、足够的学习费用配合我们双向教育， 至于您学不学得会、找不找得到工作、
                        找不找得到满意的工作，不是您所考虑的，那是我们应该考虑的职责和义务。 小班制家教式的教学、软件梦工厂地教学是我们一贯坚持已久的教学风格，
                        我们会更加努力地把这种教学风格延续下去，打造软件培训行业的精品教育！有了您的热烈支持， 我们将会做得更好，有了您的陪伴，我们将会成为职场风范!
                    </el-tab-pane>
                    <el-tab-pane label="致莘莘学子们">
                        <b>
                            莘莘学子们：
                        </b>
                            你们选择了我们，就是对我们的信任。
                    </el-tab-pane>

                </el-tabs>
            </el-drawer>

        </div>


    </div>




</template>

<script>

    export default {
        data() {
            return {
                drawer: false,
                parent_img:'',
                context:[
                    {
                        title:"学校简介 [人生从这里启航]",
                        con:"深圳软易IT培训是由一批具有8年以上IT软件开发经验和5年以上IT软件培训经验的行业专家团队组建而成的专业 培训机构。\n" +
                            "                        积累了丰富的软件开发经验和行业经验。学员在学习过程中，可以亲身体会软件公司的现场开发场景; 并熟悉整个开发过程。\n" +
                            "                        在这里学习，没有技术和经验不精的教师团队使你误入歧途；在这里学习， 没有不懂软件行业的管理团队对你指手画脚；\n" +
                            "                        在这里学习，有丰富的技术和学术氛围。在这里， 你可以安心地放心地学习完所有课程，然后再进行就业推荐，\n" +
                            "                        不会因为教学资源不足或为了完成任务， 在学员还没把技术学到手的情况，就草草把你推荐到一个待遇很差的公司的现象。"
                    },
                    {
                        title:"教学过程中控制是教学的根本",
                        con:"每个教师对每个学员进行良好的管理和控制。教师根据不同学员的情况制定学习计划， 针对基础差的学员重点进行编程思维和逻辑的培养。\n" +
                            "                        同时，在整个教学过程中， 教师根据不同学员在不同阶段不同学科的学习情况，进行重点把持，当出现学员学得不扎实的情况，\n" +
                            "                        教师会制定补救措施，进行单独辅导，从而跟上整个学习进程。",
                    },
                    {
                        title:"技术原理与动手能力是不二法则",
                        con:" 软件开发教学在培训业界存在一大误区。很多人认为，这种动手式的技术，只要能动手写代码就可以了。 至于理论概念熟不熟练、记不记得住没关系。\n" +
                            "                        所以，在教学过程中，我们不但要讲清楚理论概念、技术原理， 而且还要求学员有意识地去领会，在应用的基础上加以记忆和讲解出来，\n" +
                            "                        然后在动手实操的结合下， 才可以达到炉火纯青的境界。所以，技术原理与动手能力同等重要。良好的课程体系是教育的核心。\n" +
                            "                        结合外界软件公司和企业行业的需求，把当今流行技术及未来发展趋势的新技术都贯穿于课程体系中。 在新技术日新月异的今天，我们不局限于教材，\n" +
                            "                        更多地体现在新技术一出现，我们就开始讲解并加以应用。 未来，新技术将占据软件企业开发平台的主流地位。同时，当学员具备了良好的扎实的编程思维和逻辑基础后，\n" +
                            "                        就能很快适应和融入新技术出现的软件开发平台中。",
                    },
                    {
                        title:"小班制教学是与众不同的培训精品",
                        con:"  通过多年的教学经验和开发经验得出:真正要让一个培训班级能扎实掌握所授课程并灵活加以应用， 必须在班级的人员数量上进行控制，\n" +
                            "                        我们得出的人员数量是每班25人到30人， 正好是软件公司五到六个项目的人员数量。每个组5人，五六个项目组正好有比较并有竞争，\n" +
                            "                        在比较和竞争中学习和工作，其效率是最高的。同时人数少，还更便于教师充分掌握和控制每个学员的学习情况， 教师还能充分应对。\n",
                    },
                    {
                        title:"项目驱动式教学是教学成功的法宝",
                        con:" 为了完成一个项目，我们讲解相关知识结构，让学员有目标的学习，这种学习效果效率也是最高的。 我们的项目来自于软件公司的真实项目，\n" +
                            "                        或者项目的某一部分。通过这种项目驱动式的教学， 学员既掌握了知识结构的技术原理，又学会了应用， 同时还累积了项目经验。\n" +
                            "                        灵活的就业体系解决了学员的后顾之忧。我们给学员提供灵活的就业措施，学员可以选择自主就业、 由我们的就业专家推荐企业就业，\n" +
                            "                        学员也可以自投简历找到满意的工作。因为当你真正学到技术后， 没有哪一家软件公司不需要真正的人才。",
                    },
                ]
            };
        },
        methods:{
            setParent_img() {
                this.$emit('func',this.parent_img);
            }
        },
        beforeMount(){
            this.setParent_img();
        }
    }

</script>
<style scope>

    .el-drawer__body{
        background-color: #d3b2f8;
    }








</style>
